# Задача №13. Уставшие от необычно теплой зимы, жители решили узнать,
# действительно ли это самая длинная оттепель за всю историю наблюдений за погодой. 
# Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за
# прошлые годы. Их интересует, сколько дней длилась самая длинная оттепель. Оттепелью они называют период,
# в который среднесуточная температура ежедневно превышала 0 градусов Цельсия. Напишите программу, помогающую
# синоптикам в работе. Пользователь вводит число N – общее количество рассматриваемых дней (1 ≤ N ≤ 100). 
# В следующих строках располагается N целых чисел. Каждое число – среднесуточная температура в
# соответствующий день. Температуры – целые числа и лежат в диапазоне от –50 до 50
# Input: 6 -> -20 30 -40 50 10 -10 Output: 2

n=int(input('Введите количество дней: '))
count=0
max_days_count=0
for i in range(n):
    x=int(input('Какая сегодня температура: '))
    if x>0:
        count+=1
    else:
        count=0
if max_days_count < count:
    max_days_count=count
print(max_days_count)

# list1 = [-20, 30, -40, 50, 10, -10]
# length = 0
# max_length = 0
# for num in list1:
#     if num > 0:
#         length+=1
#     else:
#         length = 0
#     if length > max_length:
#         max_length=length
# print(max_length)